In [1]:
import numpy as np
import pandas as pd
import datetime as dt

In [2]:
df = pd.read_csv('mars-weather.csv')

In [3]:
df.head(10)

,id,terrestrial_date,sol,ls,month,min_temp,max_temp,pressure,wind_speed,atmo_opacity
0,1895,27-02-18,1977,135,Month 5,-77.0,-10.0,727.0,NaN,Sunny
1,1893,26-02-18,1976,135,Month 5,-77.0,-10.0,728.0,NaN,Sunny
2,1894,25-02-18,1975,134,Month 5,-76.0,-16.0,729.0,NaN,Sunny
3,1892,24-02-18,1974,134,Month 5,-77.0,-13.0,729.0,NaN,Sunny
4,1889,23-02-18,1973,133,Month 5,-78.0,-18.0,730.0,NaN,Sunny
5,1891,22-02-18,1972,133,Month 5,-78.0,-14.0,730.0,NaN,Sunny
6,1890,21-02-18,1971,132,Month 5,-78.0,-13.0,731.0,NaN,Sunny
7,1888,20-02-18,1970,132,Month 5,-77.0,-16.0,731.0,NaN,Sunny
8,1887,19-02-18,1969,131,Month 5,-76.0,-16.0,732.0,NaN,Sunny
9,1886,18-02-18,1968,131,Month 5,-76.0,-19.0,732.0,NaN,Sunny

In [4]:
df.shape

(1894, 10)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1894 entries, 0 to 1893
Data columns (total 10 columns):
id                  1894 non-null int64
terrestrial_date    1894 non-null object
sol                 1894 non-null int64
ls                  1894 non-null int64
month               1894 non-null object
min_temp            1867 non-null float64
max_temp            1867 non-null float64
pressure            1867 non-null float64
wind_speed          0 non-null float64
atmo_opacity        1894 non-null object
dtypes: float64(4), int64(3), object(3)
memory usage: 148.1+ KB

In [6]:
df.dtypes.value_counts()

float64    4
object     3
int64      3
dtype: int64

In [7]:
df.describe()

,id,sol,ls,min_temp,max_temp,pressure,wind_speed
count,1894.000000,1894.000000,1894.000000,1867.000000,1867.000000,1867.000000,0.0
mean,948.372228,1007.930306,169.180570,-76.121050,-12.510445,841.066417,NaN
std,547.088173,567.879561,105.738532,5.504098,10.699454,54.253226,NaN
min,1.000000,1.000000,0.000000,-90.000000,-35.000000,727.000000,NaN
25%,475.250000,532.250000,78.000000,-80.000000,-23.000000,800.000000,NaN
50%,948.500000,1016.500000,160.000000,-76.000000,-11.000000,853.000000,NaN
75%,1421.750000,1501.750000,259.000000,-72.000000,-3.000000,883.000000,NaN
max,1895.000000,1977.000000,359.000000,-62.000000,11.000000,925.000000,NaN

In [8]:
# we convert the terrestrial date column from object to datetime

In [9]:
df['terrestrial_date'] = pd.to_datetime(df['terrestrial_date'])

In [13]:
df['terrestrial_date'].head()

0   2018-02-27
1   2018-02-26
2   2018-02-25
3   2018-02-24
4   2018-02-23
Name: terrestrial_date, dtype: datetime64[ns]

In [14]:
df.isnull().sum()

id                     0
terrestrial_date       0
sol                    0
ls                     0
month                  0
min_temp              27
max_temp              27
pressure              27
wind_speed          1894
atmo_opacity           0
dtype: int64

In [15]:
df['month'] = pd.to_datetime(df.terrestrial_date).dt.to_period('M')

In [17]:
df.month.value_counts()

2015-10    31
2017-07    31
2014-01    31
2014-05    31
2014-12    31
           ..
2018-08     2
2018-09     2
2018-12     2
2018-04     1
2018-10     1
Freq: M, Name: month, Length: 84, dtype: int64

In [18]:
aa=df.iloc[:,6].name
ac=df.groupby(by='month')[aa].mean()
ab=df['max_temp'].isna()
df.loc[ab,['max_temp']]=df.loc[ab,'month'].apply(lambda x:ac[x])
df['max_temp'].isna().sum()

0

In [19]:
data = pd.DataFrame(list(df['max_temp']), index=df.terrestrial_date,columns=['max_temperature'])

In [20]:
data = data.resample('D').mean()

In [21]:
data.sample(10)

                  max_temperature
terrestrial_date
2012-03-18                    NaN
2014-05-14                 -24.00
2015-08-19                 -21.00
2015-10-16                 -27.00
2013-02-22                  -6.05
2018-02-19                 -16.00
2016-06-16                  -3.00
2018-03-15                    NaN
2013-08-05                  -5.00
2017-01-26                  -1.00